[
  {
    "id": "lion-mouse",
    "title": "The Lion and the Mouse",
    "level": "A2",
    "sentences": [
      {"en": "A mighty lion napped in the African sun.", "fa": "شیری قدرتمند زیر آفتاب آفریقا چرت می‌زد."},
      {"en": "A tiny mouse accidentally ran across his paw.", "fa": "موشی کوچک تصادفاً از روی پنجه‌اش دوید."},
      {"en": "The lion awoke and trapped the trembling creature.", "fa": "شیر بیدار شد و موجود لرزان را به دام انداخت."},
      {"en": "Spare me! I might help you someday, squeaked the mouse.", "fa": "موش جیغ زد: مرا ببخش! شاید روزی بتوانم کمک کنم."},
      {"en": "Amused, the lion released his tiny prisoner.", "fa": "شیر سرگرم شده، زندانی کوچکش را آزاد کرد."},
      {"en": "Days later, hunters caught the lion in ropes.", "fa": "روزهای بعد، شکارچیان شیر را با طناب گرفتند."},
      {"en": "The mouse appeared and gnawed through the bindings.", "fa": "موش ظاهر شد و بندها را جوید."},
      {"en": "Even the strong sometimes need the weak, whispered the mouse.", "fa": "موش زمزمه کرد: حتی قدرتمندان گاهی به ضعیفان نیاز دارند."}
    ]
  },
  {
    "id": "hodja-moon",
    "title": "Hodja and the Moon",
    "level": "A2",
    "sentences": [
      {"en": "One dark night, Nasreddin Hodja fetched water.", "fa": "شبی تاریک، نصرالدین خواجه آب آورد."},
      {"en": "He saw the moon reflected in his bucket.", "fa": "ماه را در سطلش منعکس دید."},
      {"en": "The moon has fallen into my water!, he cried.", "fa": "فریاد زد: ماه در آب من افتاده!"},
      {"en": "He rushed home and slammed the door tight.", "fa": "به خانه شتافت و در را محکم بست."},
      {"en": "When he checked the bucket, the moon was gone.", "fa": "وقتی سطل را چک کرد، ماه ناپدید شده بود."},
      {"en": "Aha! I trapped it inside my house!, he beamed.", "fa": "چشمک زد: آها! آن را در خانه حبس کردم!"}
    ]
  },
  {
    "id": "persian-carpet",
    "title": "The Weaver's Secret",
    "level": "A2",
    "sentences": [
      {"en": "In Isfahan, a master weaver created magical carpets.", "fa": "در اصفهان، بافنده‌ای استاد فرش‌های جادویی می‌بافت."},
      {"en": "His apprentice begged to learn the secret patterns.", "fa": "شاگردش التماس کرد که الگوهای مخفی را بیاموزد."},
      {"en": "Patience, the weaver said, first watch the sparrows.", "fa": "بافنده گفت: صبر کن، اول گنجشک‌ها را تماشا کن."},
      {"en": "For weeks, the boy studied birds in the courtyard.", "fa": "هفته‌ها پسر در حیاط گنجشک‌ها را مطالعه کرد."},
      {"en": "One dawn, he saw how their wings caught sunlight.", "fa": "یک سحر، دید چطور بال‌هایشان نور خورشید را می‌گیرد."},
      {"en": "He returned and wove gold into his threads.", "fa": "بازگشت و طلا را در نخ‌هایش بافت."},
      {"en": "The weaver smiled: You've found the true teacher.", "fa": "بافنده لبخند زد: معلم واقعی را یافته‌ای."}
    ]
  },
  {
    "id": "north-wind",
    "title": "North Wind's Contest",
    "level": "A2",
    "sentences": [
      {"en": "The North Wind boasted he could remove a man's cloak.", "fa": "باد شمال ادعا کرد می‌تواند شنل مردی را برباید."},
      {"en": "The Sun quietly accepted the challenge.", "fa": "خورشید آرام چالش را پذیرفت."},
      {"en": "The Wind blew fiercely, tearing trees from roots.", "fa": "باد با شدت وزید و درختان را ریشه‌کن کرد."},
      {"en": "The traveler only wrapped his cloak tighter.", "fa": "مسافر فقط شنلش را محکم‌تر پیچید."},
      {"en": "Then the Sun emerged, warming the frozen land.", "fa": "سپس خورشید ظاهر شد و زمین یخ‌زده را گرم کرد."},
      {"en": "The traveler gladly removed his heavy cloak.", "fa": "مسافر با خوشحالی شنل سنگینش را درآورد."}
    ]
  },
  {
    "id": "samarkand-apple",
    "title": "The Apple of Samarkand",
    "level": "A2",
    "sentences": [
      {"en": "Young Amir walked from Kabul to Samarkand.", "fa": "امیر جوان از کابل به سمرقند پیاده رفت."},
      {"en": "He sought the legendary sweet apple of the Silk Road.", "fa": "او در جستجوی سیب افسانه‌ای شیرین جاده ابریشم بود."},
      {"en": "After forty days, he found the ancient orchard.", "fa": "پس از چهل روز، باغ کهن را یافت."},
      {"en": "The gardener gave him a withered, bitter fruit.", "fa": "باغبان میوه‌ای خشکیده و تلخ به او داد."},
      {"en": "Amir's disappointment turned to wonder as he chewed.", "fa": "نومیدی امیر هنگام جویدن به شگفتی بدل شد."},
      {"en": "Complex flavors emerged - honey, rosewater, and memory.", "fa": "طعم‌های پیچیده ظاهر شد - عسل، گلاب و خاطره."},
      {"en": "Some treasures reveal themselves slowly, said the gardener.", "fa": "باغبان گفت: برخی گنج‌ها آهسته خود را آشکار می‌کنند."}
    ]
  },
  {
    "id": "ferryman-questions",
    "title": "The Ferryman's Questions",
    "level": "A2",
    "sentences": [
      {"en": "A scholar demanded passage across the river.", "fa": "دانشمندی تقاضای عبور از رودخانه را کرد."},
      {"en": "The old ferryman asked: What is heavier than stone?", "fa": "قایقران پیر پرسید: چه چیزی از سنگ سنگین‌تر است؟"},
      {"en": "The scholar laughed: That's simple! Lead is heavier.", "fa": "دانشمند خندید: ساده است! سرب سنگین‌تر است."},
      {"en": "But you carry no stones, observed the ferryman.", "fa": "قایقران گفت: اما تو سنگی حمل نمی‌کنی."},
      {"en": "He pointed to the scholar's bag of books.", "fa": "او به کیف کتاب‌های دانشمند اشاره کرد."},
      {"en": "Unread knowledge is heaviest of all, he murmured.", "fa": "زمزمه کرد: دانش نخوانده از همه سنگین‌تر است."},
      {"en": "The scholar sat silently throughout the crossing.", "fa": "دانشمند تمام طول عبور ساکت نشست."}
    ]
  },
  {
    "id": "blue-tile",
    "title": "The Blue Tile",
    "level": "A2",
    "sentences": [
      {"en": "In Shiraz, a mosaic artist lost his blue tile.", "fa": "در شیراز، هنرمند موزاییک‌کار کاشی آبی‌اش را گم کرد."},
      {"en": "His mosque dome would be incomplete for Ramadan.", "fa": "گنبد مسجدش برای رمضان ناقص می‌ماند."},
      {"en": "He searched markets from dawn till lantern-lighting.", "fa": "از سحر تا روشنایی فانوس‌ها بازارها را گشت."},
      {"en": "Exhausted, he sat by a fountain at dusk.", "fa": "خسته، هنگام غروب کنار فواره‌ای نشست."},
      {"en": "There in the water lay his tile - blue as twilight.", "fa":":"},
      {"en": "The moon's reflection had guided him to it.", "fa": "انعکاس ماه او را به آن هدایت کرده بود."}
    ]
  },
  {
    "id": "date-seed",
    "title": "The Date Seed",
    "level": "A1",
    "sentences": [
      {"en": "Little Ahmed planted a date seed near his tent.", "fa": "احمد کوچک هسته خرما را نزدیک چادرش کاشت."},
      {"en": "His father said: Trees need years to grow.", "fa": "پدرش گفت: درختان سال‌ها نیاز دارند تا رشد کنند."},
      {"en": "Every morning, Ahmed watered the empty sand.", "fa": "احمد هر صبح شن‌های خالی را آب می‌داد."},
      {"en": "After three springs, a green shoot appeared.", "fa": "پس از سه بهار، جوانه‌ای سبز ظاهر شد."},
      {"en": "Ahmed danced around the tiny palm tree.", "fa": "احمد دور نخل کوچک رقصید."},
      {"en": "His father watched, remembering his own childhood hope.", "fa": "پدرش تماشا کرد و امید کودکی خود را به یاد آورد."}
    ]
  },
  {
    "id": "bazaar-dream",
    "title": "The Bazaar Dream",
    "level": "A2",
    "sentences": [
      {"en": "A poor tea-seller napped at his stall.", "fa": "فروشنده چای فقیر در غرفه‌اش چرت زد."},
      {"en": "He dreamed of finding a ruby in his teapot.", "fa": "او خواب یافتن یاقوتی در قوری‌اش را دید."},
      {"en": "Waking excitedly, he emptied all his tea.", "fa": "با هیجان بیدار شد و تمام چایش را خالی کرد."},
      {"en": "No ruby appeared - only broken leaves.", "fa": "هیچ یاقوتی ظاهر نشد - فقط برگ‌های خرد شده."},
      {"en": "Disappointed, he bought fresh tea on credit.", "fa": "نومید، چای تازه به نسیه خرید."},
      {"en": "That afternoon, a merchant praised his new tea's flavor.", "fa": "آن بعدازظهر، تاجری طعم چای تازه‌اش را ستود."},
      {"en": "He sold all his tea before sunset.", "fa": "قبل از غروب همه چایش را فروخت."},
      {"en": "Sometimes the treasure is in the waking, he realized.", "fa": "متوجه شد: گاهی گنج در بیداری است."}
    ]
  },
  {
    "id": "silent-sufi",
    "title": "The Silent Sufi",
    "level": "A2",
    "sentences": [
      {"en": "A famous Sufi master stopped speaking.", "fa": "استاد صوفی مشهور سخن گفتن را متوقف کرد."},
      {"en": "Disciples worried: Has he lost his wisdom?", "fa": "مریدان نگران شدند: آیا خردش را از دست داده؟"},
      {"en": "Pilgrims came seeking advice but got silence.", "fa": "زائران برای مشاوره آمدند اما سکوت یافتند."},
      {"en": "They sat with him watching sunsets and sparrows.", "fa": "با او نشستند و غروب‌ها و گنجشک‌ها را تماشا کردند."},
      {"en": "Months later, a disciple finally understood.", "fa": "ماه‌ها بعد، مریدی سرانجام فهمید."},
      {"en": "He told visitors: Bring questions needing no answers.", "fa": "به بازدیدکنندگان گفت: سوالاتی بیاورید که پاسخی نیاز ندارند."},
      {"en": "The master smiled his first smile in a year.", "fa": "استاد برای اولین بار در یک سال لبخند زد."}
    ]
  }
]